% insert2(X, Y, L1, L2)
% X - елемент, який треба вставити
% Y - елемент, перед яким треба вставити елемент X
% L1 — список, у який треба вставити елемент
% L2 - список, у якому перед елементом X знаходиться елемент Y

% Якщо елемент Y знаходиться у голові початкового списку, вставити
% у результуючий список елемент X перед елементом Y
insert2(X, Y, [Y | T], [X, Y | T ]).
% Якщо елемент Y не співпадає з головою початкового списку, перейти
% до наступних елементів списку
insert2(X, Y, [H | T], [H | L ]) :-
    dif(Y, H),
    insert2(X, Y, T, L).
