% SWI Prolog

% Предикат sub_2_while_positive(X, Res) потрібен, щоб визначити
% парне число чи ні. Він рекурсивно віднімає від числа X
% значення 2, доки X > 0.
%
% Умова виходу 1: якщо на вхід подано значення 0 —
% результат 0 (парне число)
sub_2_while_positive(0, 0).
% Умова виходу 2: якщо на вхід подано значення -1 —
% результат -1 (непарне число)
sub_2_while_positive(-1, -1).
% Тіло циклу
sub_2_while_positive(X, Res) :-
    % Поки на вході додатне число
    X > 0,
    % Відняти від нього 2 і присвоїти тимчасовій змінній
    Tmp is X - 2,
    % Спробувати відняти 2 від тимчасового значення Tmp
    sub_2_while_positive(Tmp, Res),
    % Відсікання, щоб знайти лише один результат
    !.

% Перевіряє, чи парне число.
is_even(X) :-
    % Віднімати 2 від числа X, доки воно додатне
    sub_2_while_positive(X, Res),
    % Правило істинне, тобто число парне, якщо результат = 0.
    Res = 0.

% Основна ціль програми
run :-
    % Зчитати число зі стандартного вводу
    read(X),
    % Перевірити, що введене ціле число
    integer(X),
    % Перевірити, що введене число додатне
    X > 0,
    % Перевірити, чи парне введене число
    is_even(X).
